pilot_case/PILOT-PCCV-TRANSIENT-001/openfoam_reconstructed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          1500;
        startFace       314009;
    }
    outlet
    {
        type            patch;
        nFaces          1500;
        startFace       315509;
    }
    sideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3000;
        startFace       317009;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2500;
        startFace       320009;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2500;
        startFace       322509;
    }
    pccvWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3991;
        startFace       325009;
    }
)

// ************************************************************************* //
