pilot_case/PILOT-PCCV-TRANSIENT-001/openfoam_reconstructed/constant/turbulenceProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType laminar;
