pilot_case/PILOT-PCCV-TRANSIENT-001/openfoam_reconstructed/constant/transportProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object transportProperties;
}
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 1.5e-05;
