pilot_case/PILOT-PCCV-TRANSIENT-001/openfoam_reconstructed/system/fvSolution
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvSolution;
}
solvers
{
    p { solver GAMG; tolerance 1e-8; relTol 0.05; smoother GaussSeidel; }
    pFinal { $p; relTol 0; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-9; relTol 0.05; }
    UFinal { $U; relTol 0; }
}
PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
}
relaxationFactors { fields { p 0.3; } equations { U 0.7; } }
